
#include <iostream>
using namespace std; 

int main()
{    
	setlocale(LC_ALL, "Russian");
	double a, f;
	cout << "Дано действительное число а. Вычислить f(а). Введите а:" << endl;
	cin >> a;
	if (a < 0) {
		f = 0;
	}
	else if (a >= 0 && a <= 2) {
		f = a * a + 4 * a + 5;
	}
	else {
		f = 1 / (a * a + 4 * a + 5);
	}
	cout << "f(a) = " << f << endl;

	double x, y;
	cout << "Даны действительные числа x, y. Определить, принадлежит ли точка с координатами (x; y) заштрихованной части плоскости." << endl;
	cout << " Введите x:" << endl;
	cin >> x;
	cout << "Введите y:" << endl;
	cin >> y;
	if (x<=1 && x>=0 && y<=1 && y>=0) {
		if ((x + y) <= 1) cout << "Точка с координатами (" << x << "; " << y << ") принадлежит заштрихованой части плоскости";
		else cout << "Точка с координатами (" << x << "; " << y << ") НЕ принадлежит заштрихованой части плоскости";
	}
	else if (x >= -1 && x <= 0 && y <= 1 && y >= 0) {
		if ((y - x) <= 1) cout << "Точка с координатами (" << x << "; " << y << ") принадлежит заштрихованой части плоскости";
		else cout << "Точка с координатами (" << x << "; " << y << ") НЕ принадлежит заштрихованой части плоскости";
	}
	else if ((x >= -1 && x <= 0 && y >= -1 && y <= 0)) {
		if ((x + y) >= -1) cout << "Точка с координатами (" << x << "; " << y << ") принадлежит заштрихованой части плоскости";
		else cout << "Точка с координатами (" << x << "; " << y << ") НЕ принадлежит заштрихованой части плоскости";
	}
	else if (x <= 1 && x >= 0 && y >= -1 && y <= 0) {
		if ((y - x) >= -1) cout << "Точка с координатами (" << x << "; " << y << ") принадлежит заштрихованой части плоскости";
		else cout << "Точка с координатами (" << x << "; " << y << ") НЕ принадлежит заштрихованой части плоскости";
	}
	else cout << "Точка с координатами (" << x << "; " << y << ") НЕ принадлежит заштрихованой части плоскости";
}
